In [23]:
import pandas as pd
import numpy as np

print("Creating the data frames")
sports1={
    "Athletics":"Sahil1",
    "Football":"Ishan1",
    "Tenis":"Annanya1"
}
sports2={
    "Athletics":"Sahil2",
    "Football":"Ishan2",
    "Tenis":"Annanya2"
}
sports3={
    "Athletics":"Sahil3",
    "Football":"Ishan3",
    "Tenis":"Annanya3"
}
df=pd.DataFrame([sports1,sports2,sports3],index=["team1","team2","team3"])
df

Creating the data frames

      Athletics Football     Tenis
team1    Sahil1   Ishan1  Annanya1
team2    Sahil2   Ishan2  Annanya2
team3    Sahil3   Ishan3  Annanya3

In [24]:

# Now operations on the data frame cretaed above

# Using ilco
print(df.iloc[2])

# Using loc
print(df.loc["team1"])

Athletics      Sahil3
Football       Ishan3
Tenis        Annanya3
Name: team3, dtype: object
Athletics      Sahil1
Football       Ishan1
Tenis        Annanya1
Name: team1, dtype: object

In [25]:
df.loc["team1",["Athletics","Football","Tenis"]]

Athletics      Sahil1
Football       Ishan1
Tenis        Annanya1
Name: team1, dtype: object

In [26]:
# Accessing the single box of data
df.loc["team2","Athletics"]

'Sahil2'

In [27]:

#or we can access the data as:
#but try to avoid this as this gives the copy of the data frame instead of the view on the dataframe
df.loc["team1"]["Tenis"]

'Annanya1'

In [28]:

# Getting the transpose of the data frame
df.T

              team1     team2     team3
Athletics    Sahil1    Sahil2    Sahil3
Football     Ishan1    Ishan2    Ishan3
Tenis      Annanya1  Annanya2  Annanya3

In [29]:

#Slicing with the loc or iloc 
print(df.loc[:])
print(df.loc[:,["Athletics","Football"]])

      Athletics Football     Tenis
team1    Sahil1   Ishan1  Annanya1
team2    Sahil2   Ishan2  Annanya2
team3    Sahil3   Ishan3  Annanya3
      Athletics Football
team1    Sahil1   Ishan1
team2    Sahil2   Ishan2
team3    Sahil3   Ishan3

In [30]:
# Dropinng/Deleting  the data:
# Drop using: drop()

#This dosen't delete from the original dataframe but creates the new copy
#drop takes two optional parameters : 
    #inplace: if set to true deletes inlpace else creates the copy
    #axex: if set to 0 means the row and if set to 1 means the column
df_new=df.drop('team1')
df_new

      Athletics Football     Tenis
team2    Sahil2   Ishan2  Annanya2
team3    Sahil3   Ishan3  Annanya3

In [31]:
print("\nCheck after the drop command when inplace is default to false")
df

Check after the drop command when inplace is default to false

      Athletics Football     Tenis
team1    Sahil1   Ishan1  Annanya1
team2    Sahil2   Ishan2  Annanya2
team3    Sahil3   Ishan3  Annanya3

In [32]:
# Deleting inpalce by setting the inplace parameter to true

df.drop('team1',inplace=True)
df

      Athletics Football     Tenis
team2    Sahil2   Ishan2  Annanya2
team3    Sahil3   Ishan3  Annanya3

In [33]:
df.drop("Football",inplace=True,axis=1)
df

      Athletics     Tenis
team2    Sahil2  Annanya2
team3    Sahil3  Annanya3

In [34]:

#This deletes from the original dataframe permanantly
print("This deletes only the keys: i.e only along the columns and not the particular row. So do that by drop function only")
print("Drop using: del keyword")
del df["Tenis"]
df

This deletes only the keys: i.e only along the columns and not the particular row. So do that by drop function only
Drop using: del keyword

      Athletics
team2    Sahil2
team3    Sahil3